{
    "intents": [
      {
        "tag": "greetings",
        "patterns": ["привет", "здравствуйте", "добрый день", "здорово", "хай"],
        "responses": ["Приветствую!", "Здравствуйте! Как могу помочь?", "Привет! Рад вас видеть."]
      },
      {
        "tag": "goodbye",
        "patterns": ["пока", "до свидания", "увидимся", "до скорого"],
        "responses": ["До свидания!", "Хорошего дня!", "До скорого!"]
      },
      {
        "tag": "thanks",
        "patterns": ["спасибо", "благодарю", "огромное спасибо", "большое спасибо"],
        "responses": ["Рад помочь!", "Не за что!", "Всегда готов помочь!"]
      },
      {
        "tag": "genres",
        "patterns": ["рок", "поп", "джаз", "классика", "электронная музыка"],
        "responses": ["Рок - это классика! Люблю слушать AC/DC и Metallica.",
                      "Поп-музыка всегда в тренде. Я люблю слушать Adele и Ed Sheeran.",
                      "Джаз - это музыка для души. Люблю слушать Miles Davis и John Coltrane.",
                      "Классика - это вечное! Мои любимые композиторы - Бах и Моцарт.",
                      "Электронная музыка - это что-то новое! Я люблю слушать Daft Punk и The Chemical Brothers."]
      },
      {
        "tag": "artists",
        "patterns": ["битлз", "боб дилан", "майкл джексон", "мадонна", "бритни спирс"],
        "responses": ["The Beatles - легенды рок-музыки! Мои любимые песни - Let It Be и Hey Jude.",
                      "Боб Дилан - великий поэт и музыкант! Мои любимые песни - Like a Rolling Stone и The Times They Are A-Changin'.",
                      "Майкл Джексон - король поп-музыки! Мои любимые песни - Billie Jean и Thriller.",
                      "Мадонна - королева поп-музыки! Мои любимые песни - Like a Prayer и Vogue.",
                      "Бритни Спирс - принцесса поп-музыки! Мои любимые песни - Baby One More Time и Toxic."]
      },
      {
        "tag": "instruments",
        "patterns": ["гитара", "барабаны", "скрипка", "фортепиано", "саксофон"],
        "responses": ["Гитара - это мое любимое инструмент! Люблю слушать Jimi Hendrix и Eric Clapton.",
                      "Барабаны - это сердце рок-музыки! Мои любимые драммеры - John Bonham и Neil Peart.",
                      "Скрипка - это инструмент для души! Люблю слушать Yehudi Menuhin и Itzhak Perlman.",
                      "Фортепиано - это инструмент классической музыки! Мои любимые пианисты - Frederic Chopin и Ludwig van Beethoven.",
                      "Саксофон - это инструмент для джаза! Люблю слушать Charlie Parker и John Coltrane."]
      },
      {
        "tag": "bands",
        "patterns": ["queen", "the beatles", "led zeppelin", "pink floyd", "metallica"],
        "responses": ["Queen - группа легендарного Фредди Меркьюри! Мои любимые песни - Bohemian Rhapsody и We Will Rock You.",
                      "The Beatles - легенды рок-музыки! Мои любимые песни - Let It Be и Hey Jude.",
                      "Led Zeppelin - группа, которую слушают поколения! Мои любимые песни - Stairway to Heaven и Kashmir.",
                      "Pink Floyd - группа, которая перевернула мир музыки! Мои любимые песни - Comfortably Numb и Wish You Were Here.",
                      "Metallica - группа, которая придумала thrash-метал! Мои любимые песни - Enter Sandman и Nothing Else Matters."]
      },
      {
        "tag": "concerts",
        "patterns": ["концерт", "билеты", "где", "когда", "время"],
        "responses": ["Концерты - это замечательно! Можете купить билеты на сайте афишы концертов.",
                      "Билеты на концерты можно купить онлайн или в кассах концертных залов.",
                      "Концерты проходят в различных залах - от маленьких клубов до больших стадионов.",
                      "Дата и время концерта зависят от многих факторов, поэтому лучше проверять на сайтах организаторов."]
      },
      {
        "tag": "albums",
        "patterns": ["любимый альбом", "новый альбом", "хорошие альбомы", "классические альбомы", "альбом года"],
        "responses": ["Мой любимый альбом - The Dark Side of the Moon от Pink Floyd.", "Новый альбом - Happier Than Ever от Billie Eilish.",
                      "Хорошие альбомы - это субъективно, но я рекомендую альбомы OK Computer от Radiohead и Thriller от Michael Jackson.",
                      "Классические альбомы - это Mezzanine от Massive Attack и Nevermind от Nirvana.",
                      "Альбом года - это вопрос вкуса, но многие считают, что альбомы 2021 года, такие как Solar Power от Lorde и Sour от Olivia Rodrigo, будут в числе лучших."]
      }
    ]
  }